fix_the_buses/app/controllers/hitch_controller.rb

SELECT * FROM "routes" WHERE ("routes"."number" IS NULL) LIMIT 1
---
  def lookup
    @params_disp = params
    @route_str = params[:hitch][:route]
    @route = Route.find_by_number(@route_str)